### Accessing Elements in pandas DataFrames

In [1]:
import pandas as pd

In [6]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
items

[{'bikes': 20, 'pants': 30, 'watches': 35},
 {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

In [7]:
store_items = pd.DataFrame(items, index=['store 1', 'store 2'])

store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

### Access Columns

In [15]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

### Access Multipule columns

In [19]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

### Access Specific row

In [24]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

### Access specific elements

In [25]:
store_items['bikes']['store 2']

15

### Add new columns

In [28]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [29]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

### Add a new rows

In [32]:
new_items = [{'bikes':20 , 'pants': 30, 'watches': 35, 'glasses': 4}]
new_items

[{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

In [33]:
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [34]:
store_items = store_items.append(new_store)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [35]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [36]:
store_items.insert(4, 'shoes', [8, 5, 0])
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new_watches
store 1     20     30       35      NaN      8    15.0   45.0          NaN
store 2     15      5       10     50.0      5     2.0    7.0         10.0
store 3     20     30       35      4.0      0     NaN    NaN         35.0

### delete columns

In [37]:
store_items.pop('new_watches')

store 1     NaN
store 2    10.0
store 3    35.0
Name: new_watches, dtype: float64

In [38]:
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     2.0    7.0
store 3     20     30       35      4.0      0     NaN    NaN

In [42]:
store_items.drop(['watches', 'shoes'], axis=1, inplace=True)

In [43]:
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

In [44]:
store_items.drop(['store 1', 'store 2'], axis=0, inplace=True)
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

### Rename Labels

In [48]:
store_items.rename(columns={'bikes': 'hats'}, inplace=True)
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [50]:
store_items.rename(index={'store 3': 'last store'}, inplace=True)
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

In [62]:
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

In [63]:
package_items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
package_items

[{'bikes': 20, 'pants': 30, 'watches': 35},
 {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

In [64]:
df = pd.DataFrame(package_items, index=['Store 1', 'Store 2'])

In [65]:
df

         bikes  pants  watches  glasses
Store 1     20     30       35      NaN
Store 2     15      5       10     50.0

In [69]:
df['new item'] = [4, None]
df

         bikes  pants  watches  glasses  new item
Store 1     20     30       35      NaN       4.0
Store 2     15      5       10     50.0       NaN

In [70]:
df.drop('new item', axis=1, inplace=True)

In [71]:
df

         bikes  pants  watches  glasses
Store 1     20     30       35      NaN
Store 2     15      5       10     50.0

In [72]:
items

[{'bikes': 20, 'pants': 30, 'watches': 35},
 {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

In [73]:
new_items

[{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

In [74]:
df = df.append(pd.DataFrame(new_items))

In [75]:
df

         bikes  pants  watches  glasses
Store 1     20     30       35      NaN
Store 2     15      5       10     50.0
0           20     30       35      4.0